{
  "meta": {
    "project": "Adwonder CRM",
    "date": "2025-08-25",
    "prepared_by": "Generated by TestSprite"
  },
  "product_overview": "Adwonder CRM is a web-based CRM platform tailored for marketing agencies, enabling centralized management of clients, commercial deals, operational activities, and deadlines. It provides an intuitive, no-login interface offering real-time visibility into pipeline status, client data, and performance metrics.",
  "core_goals": [
    "Centralize management of clients, prospects, and commercial deals in an intuitive CRM.",
    "Provide an operational dashboard with real-time pipeline and deal status views.",
    "Simplify interaction by allowing access without authentication or login.",
    "Enable management of commercial activities like calls, emails, follow-ups with scheduling and reminders.",
    "Offer advanced client and deal tracking features including status, estimated values, deadlines, and contract monitoring.",
    "Support operational project management with collaborators, budgets, and assignments.",
    "Provide notification and reminder systems for deadlines and contract expirations.",
    "Allow export and reporting with analytics to monitor business and commercial performance.",
    "Ensure scalability for future integration with external APIs, multi-user roles, and cloud data storage."
  ],
  "key_features": [
    "Client Management: CRUD operations, advanced filters, Excel import, client status tracking (Lead, Prospect, Active, Inactive).",
    "Deal Management: Custom titles, economic values (monthly/one-time), states (In Progress, Won, Lost, Postponed), performance tracking.",
    "Activity Tracking: Manage calls, emails, meetings with outcomes, notes and reminders.",
    "Operational Dashboard: Kanban-style pipeline views, metrics, KPIs, and graphs.",
    "Project Operations: Manage projects with collaborators, budgets, timelines, and token-based incentive system.",
    "Collaborator Management: Roles, compensations, token balances, project assignments.",
    "Notification System: Automated reminders for contract deadlines and follow-ups.",
    "Reports & Analytics: Visual charts, Excel export, and performance analysis tools.",
    "User Management: Role-based access control and user approval (future integration).",
    "Authentication Context: Global user authentication state management (within future scope).",
    "Integration with Supabase for centralized data persistence (planned/scalable).",
    "Layout & Navigation: Sidebar with lazy loading and active state management for seamless UX."
  ],
  "user_flow_summary": [
    "User accesses Adwonder CRM via public link without authentication.",
    "User views the operational dashboard showing current pipeline, deals, and KPIs.",
    "User creates or edits client data including status and contact information.",
    "User creates or modifies commercial deals, assigning states, values, and deadlines.",
    "User tracks operational activities such as calls, emails, meetings, adding notes and outcomes.",
    "User manages projects, collaborators, budgets, and timelines alongside token assignments.",
    "System sends notifications for contract deadlines and reminders automatically.",
    "User exports reports or views analytics dashboards to monitor business performance."
  ],
  "validation_criteria": [
    "System allows CRUD operations for clients, deals, activities, projects and collaborators with data persisted reliably.",
    "Dashboard correctly displays up-to-date KPIs, metrics, and deal pipeline statuses.",
    "Import functionality for client data via Excel is tested and works without data loss.",
    "Notification system triggers timely reminders for contract deadlines and follow-ups.",
    "Report generation exports correctly in Excel format and shows accurate analytics.",
    "UI components load efficiently with accurate state management in sidebar navigation.",
    "The system supports unauthenticated public access with data security considerations.",
    "TypeScript types and interfaces cover all data models ensuring type safety.",
    "Error handling utilities capture and report validation and operational errors gracefully.",
    "Future scalability is supported by clean abstraction for backend integrations and multi-user management."
  ],
  "code_summary": {
    "tech_stack": [
      "TypeScript",
      "React 18",
      "Vite",
      "Supabase",
      "TailwindCSS",
      "Lucide React",
      "React Hot Toast",
      "Date-fns",
      "Recharts",
      "XLSX",
      "ESLint",
      "PostCSS",
      "Autoprefixer"
    ],
    "features": [
      {
        "name": "Dashboard",
        "description": "Dashboard principale con statistiche, metriche di performance, grafici e KPI del business",
        "files": [
          "src/components/Dashboard/Dashboard.tsx",
          "src/components/Dashboard/StatsCard.tsx",
          "src/services/dashboardService.ts"
        ]
      },
      {
        "name": "Client Management",
        "description": "Gestione completa dei clienti con CRUD, importazione Excel, filtri avanzati e tracking contratti",
        "files": [
          "src/components/Clients/ClientList.tsx",
          "src/components/Clients/ClientForm.tsx",
          "src/services/clientService.ts"
        ]
      },
      {
        "name": "Deal Management",
        "description": "Gestione trattative commerciali con stati, valori stimati, scadenze e tracking performance",
        "files": [
          "src/components/Deals/DealList.tsx",
          "src/components/Deals/DealForm.tsx",
          "src/services/dealService.ts"
        ]
      },
      {
        "name": "Activity Tracking",
        "description": "Tracciamento attività commerciali (call, email, meeting) con esiti e note",
        "files": [
          "src/components/Activities/ActivityList.tsx",
          "src/components/Activities/ActivityForm.tsx",
          "src/services/activityService.ts"
        ]
      },
      {
        "name": "Project Operations",
        "description": "Gestione progetti operativi con collaboratori, budget, timeline e sistema a gettoni",
        "files": [
          "src/components/Operations/Operations.tsx",
          "src/components/Operations/ProjectCard.tsx",
          "src/components/Operations/ProjectForm.tsx",
          "src/services/projectService.ts"
        ]
      },
      {
        "name": "Collaborator Management",
        "description": "Gestione collaboratori con ruoli, compensi, gettoni disponibili e assegnazioni progetti",
        "files": [
          "src/components/Operations/CollaboratorList.tsx",
          "src/components/Operations/CollaboratorForm.tsx",
          "src/services/collaboratorService.ts"
        ]
      },
      {
        "name": "Notification System",
        "description": "Sistema notifiche per scadenze contratti, reminder e solleciti automatici",
        "files": [
          "src/components/Layout/NotificationCenter.tsx",
          "src/services/notificationService.ts"
        ]
      },
      {
        "name": "Reports & Analytics",
        "description": "Sistema di reportistica con grafici, export Excel e analisi performance commerciali",
        "files": [
          "src/components/Reports/Reports.tsx"
        ]
      },
      {
        "name": "User Management",
        "description": "Gestione utenti con sistema di approvazione, ruoli e controllo accessi",
        "files": [
          "src/components/Admin/UserManagement.tsx"
        ]
      },
      {
        "name": "Authentication Context",
        "description": "Context React per gestione autenticazione e stato utente globale",
        "files": [
          "src/contexts/AuthContext.tsx"
        ]
      },
      {
        "name": "Layout & Navigation",
        "description": "Sidebar di navigazione con lazy loading dei componenti e gestione stato attivo",
        "files": [
          "src/components/Layout/Sidebar.tsx",
          "src/App.tsx"
        ]
      },
      {
        "name": "Supabase Integration",
        "description": "Configurazione e integrazione con database Supabase per persistenza dati",
        "files": [
          "src/lib/supabase.ts"
        ]
      },
      {
        "name": "Type Definitions",
        "description": "Definizioni TypeScript complete per tutti i modelli di dati e interfacce",
        "files": [
          "src/types/index.ts"
        ]
      },
      {
        "name": "Utility Functions",
        "description": "Funzioni di utilità per gestione errori e validazione dati",
        "files": [
          "src/utils/errorHandler.ts",
          "src/utils/validation.ts"
        ]
      },
      {
        "name": "Database Scripts",
        "description": "Script per testing e popolamento database con dati di esempio",
        "files": [
          "src/scripts/addJustFashionClient.ts",
          "src/scripts/testClientInsertion.ts"
        ]
      }
    ]
  }
}
